#+CATEGORY: ░ SH.WRAP ░
#+FILETAGS: #project #task #sh_wrap
#+OPTIONS: ^:nil toc:nil num:nil author:nil timestamp:nil
#+COLUMNS: %50ITEM TODO %3PRIORITY %Effort %Effort(Effort Children){:} %10CLOCKSUM
#+OPTIONS: H:1 prop:nil d:nil tags:nil p:t c:nil pri:t

#+HUGO_BASE_DIR: ../site
#+HUGO_SECTION: project
#+HUGO_FRONT_MATTER_FORMAT: yaml
#+HUGO_CUSTOM_FRONT_MATTER:
#+HUGO_DRAFT: false

#+begin_export markdown
---
title: Pool of tasks
date: 2022-05-21T04:04:13+03:00
aliases:
  - /project/todo/todo.md
  - /project/todo/todo.org
url: /project/todo/todo.html
tags: ["project", "task"]
weight: 31
---
#+end_export

*** PROGRESS Create workflow to run tests on push, PR                :ACTIVE:
    DEADLINE: <2023-01-11 Wed> SCHEDULED: <2023-01-11 Wed>
    :LOGBOOK:
    - State "PROGRESS"   from "STARTED"    [2023-01-11 Wed 21:28] \\
      test-runner added to ci
    CLOCK: [2023-01-11 Wed 21:03]--[2023-01-11 Wed 21:28] =>  0:25
    - State "STARTED"    from "TODO"       [2023-01-11 Wed 21:03]
    :END:
    <2023-01-11 Wed>

**** PROGRESS Chose documentation generation system    :milestone_001:ACTIVE:
     DEADLINE: <2023-01-09 Mon> SCHEDULED: <2023-01-08 Sun>
     :PROPERTIES:
     :Effort:   04:00
     :END:
     :LOGBOOK:
     - State "PROGRESS"   from "STARTED"    [2023-01-11 Wed 08:03] \\
       Markdown prefixed with ## + simple grep function for now
       To be replaced later.
     CLOCK: [2023-01-11 Wed 07:15]--[2023-01-11 Wed 08:03] =>  0:48
     CLOCK: [2023-01-10 Tue 18:45]--[2023-01-10 Tue 18:55] =>  0:10
     - State "STARTED"    from "NEXT"       [2023-01-08 Sun 16:10]
     :END:
     <2023-01-03 Tue>

***** PROGRESS Integrate documentation generation into documentation pipeline :ACTIVE:
      DEADLINE: <2023-01-11 Wed> SCHEDULED: <2023-01-11 Wed>
      :LOGBOOK:
      - State "PROGRESS"   from "STARTED"    [2023-01-11 Wed 20:35] \\
        GH action tested
      CLOCK: [2023-01-11 Wed 17:24]--[2023-01-11 Wed 20:35] =>  3:11
      CLOCK: [2023-01-11 Wed 14:52]--[2023-01-11 Wed 14:59] =>  0:07
      - State "STARTED"    from "TODO"       [2023-01-11 Wed 14:52]
      :END:
      <2023-01-11 Wed>

***** DONE Document existing code base
      CLOSED: [2023-01-11 Wed 13:18] DEADLINE: <2023-01-11 Wed> SCHEDULED: <2023-01-11 Wed>
      :LOGBOOK:
      - State "DONE"       from "STARTED"    [2023-01-11 Wed 13:18]
      CLOCK: [2023-01-11 Wed 12:24]--[2023-01-11 Wed 13:18] =>  0:54
      CLOCK: [2023-01-11 Wed 10:45]--[2023-01-11 Wed 12:00] =>  1:15
      CLOCK: [2023-01-11 Wed 08:59]--[2023-01-11 Wed 10:45] =>  1:46
      CLOCK: [2023-01-11 Wed 08:07]--[2023-01-11 Wed 08:08] =>  0:01
      - State "STARTED"    from "TODO"       [2023-01-11 Wed 08:05]
      :END:
      <2023-01-11 Wed>

**** PROGRESS Fix busybox realpath is different                      :ACTIVE:
     DEADLINE: <2023-01-12 Thu> SCHEDULED: <2023-01-11 Wed>
     :LOGBOOK:
     - State "PROGRESS"   from "STARTED"    [2023-01-12 Thu 09:39] \\
       somewhat fixed
     CLOCK: [2023-01-12 Thu 07:54]--[2023-01-12 Thu 08:42] =>  0:48
     CLOCK: [2023-01-12 Thu 07:00]--[2023-01-12 Thu 07:12] =>  0:12
     CLOCK: [2023-01-12 Thu 06:00]--[2023-01-12 Thu 06:40] =>  0:40
     - State "STARTED"    from "TODO"       [2023-01-11 Wed 21:53]
     :END:
     <2023-01-11 Wed>
**** DONE Fix bash 5.0 unset _shwrap_fds["${fd_scope}"]: bad array subscript
     CLOSED: [2023-01-12 Thu 10:26]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2023-01-12 Thu 10:26]
     CLOCK: [2023-01-12 Thu 10:17]--[2023-01-12 Thu 10:26] =>  0:09
     - State "STARTED"    from "TODO"       [2023-01-12 Thu 10:17]
     :END:
     <2023-01-12 Thu>

**** PROGRESS Create user, development and project sections :milestone_001:ACTIVE:
     DEADLINE: <2023-01-10 Tue> SCHEDULED: <2023-01-10 Tue>
     :PROPERTIES:
     :Effort:   01:00
     :END:
     :LOGBOOK:
     - State "PROGRESS"   from "STARTED"    [2023-01-11 Wed 17:23] \\
       sections created
     CLOCK: [2023-01-11 Wed 16:54]--[2023-01-11 Wed 17:23] =>  0:29
     CLOCK: [2023-01-11 Wed 15:26]--[2023-01-11 Wed 16:00] =>  0:34
     - State "STARTED"    from "NEXT"       [2023-01-11 Wed 15:26]
     :END:
     <2022-12-22 Thu>

*** DONE Add README
    CLOSED: [2022-12-27 Tue 20:38] DEADLINE: <2022-12-22 Thu> SCHEDULED: <2022-12-22 Thu>
    :PROPERTIES:
    :Effort:   02:00
    :END:
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2022-12-27 Tue 20:38]
    CLOCK: [2022-12-22 Thu 15:36]--[2022-12-22 Thu 17:15] =>  1:39
    CLOCK: [2022-12-22 Thu 15:06]--[2022-12-22 Thu 15:10] =>  0:04
    - State "STARTED"    from "NEXT"       [2022-12-22 Thu 15:06]
    :END:

*** PROGRESS Update docker.org in actions-org with actual documentation :ACTIVE:
    :LOGBOOK:
    - State "PROGRESS"   from "STARTED"    [2023-01-09 Mon 10:46] \\
      ... don't want to talk about it
    CLOCK: [2023-01-09 Mon 06:01]--[2023-01-09 Mon 10:45] =>  4:44
    CLOCK: [2023-01-08 Sun 18:35]--[2023-01-08 Sun 18:49] =>  0:14
    - State "STARTED"    from "TODO"       [2023-01-08 Sun 18:35]
    :END:
    <2023-01-08 Sun>

**** DONE Add script and GH action for documentation generation system
     CLOSED: [2023-01-11 Wed 14:49] DEADLINE: <2023-01-11 Wed> SCHEDULED: <2023-01-11 Wed>
     :LOGBOOK:
     - State "DONE"       from "PROGRESS"   [2023-01-11 Wed 14:49]
     - State "PROGRESS"   from "STARTED"    [2023-01-11 Wed 14:49] \\
       merged
     CLOCK: [2023-01-11 Wed 14:16]--[2023-01-11 Wed 14:49] =>  0:33
     CLOCK: [2023-01-11 Wed 13:24]--[2023-01-11 Wed 14:11] =>  0:47
     - State "STARTED"    from "TODO"       [2023-01-11 Wed 13:24]
     :END:
     <2023-01-11 Wed>

**** DONE [#A] Create GH actions to use docker images from docker hub :coding:milestone_001:
     CLOSED: [2023-01-10 Tue 09:53] DEADLINE: <2023-01-08 Sun> SCHEDULED: <2023-01-08 Sun>
     :PROPERTIES:
     :Effort:   04:00
     :END:
     :LOGBOOK:
     - State "DONE"       from "PROGRESS"   [2023-01-10 Tue 09:53]
     CLOCK: [2023-01-10 Tue 04:14]--[2023-01-10 Tue 05:38] =>  1:24
     - State "PROGRESS"   from "STARTED"    [2023-01-10 Tue 04:13] \\
       almost done
     CLOCK: [2023-01-10 Tue 03:34]--[2023-01-10 Tue 04:13] =>  0:39
     CLOCK: [2023-01-10 Tue 01:47]--[2023-01-10 Tue 02:20] =>  0:33
     CLOCK: [2023-01-09 Mon 17:33]--[2023-01-09 Mon 20:58] =>  3:25
     CLOCK: [2023-01-09 Mon 13:48]--[2023-01-09 Mon 16:13] =>  2:25
     CLOCK: [2023-01-09 Mon 10:47]--[2023-01-09 Mon 12:56] =>  2:09
     CLOCK: [2023-01-08 Sun 16:31]--[2023-01-08 Sun 16:57] =>  0:26
     - State "STARTED"    from "NEXT"       [2023-01-08 Sun 16:09]
     - Rescheduled from "[2022-12-22 Thu]" on [2023-01-08 Sun 12:57] \\
       rescheduled
     :END:
     <2022-10-31 Mon>

***** DONE Fix test-workflows-hub permission denied
      CLOSED: [2023-01-10 Tue 09:48] DEADLINE: <2023-01-12 Thu> SCHEDULED: <2023-01-10 Tue>
      :LOGBOOK:
      - State "DONE"       from "PROGRESS"   [2023-01-10 Tue 09:48]
      - State "PROGRESS"   from "STARTED"    [2023-01-10 Tue 09:47] \\
        bug founded and fixed
      CLOCK: [2023-01-10 Tue 09:42]--[2023-01-10 Tue 09:48] =>  0:06
      - State "STARTED"    from "TODO"       [2023-01-10 Tue 09:42]
      :END:
      <2023-01-10 Tue>

**** DONE Create docker containers and GH action for test harness :milestone_001:
     CLOSED: [2023-01-10 Tue 18:30] DEADLINE: <2023-01-09 Mon> SCHEDULED: <2023-01-09 Mon>
     :PROPERTIES:
     :Effort:   01:00
     :END:
     :LOGBOOK:
     - State "DONE"       from "PROGRESS"   [2023-01-10 Tue 18:30]
     CLOCK: [2023-01-10 Tue 18:19]--[2023-01-10 Tue 18:30] =>  0:11
     - State "PROGRESS"   from "PROGRESS"   [2023-01-10 Tue 18:19] \\
       merged
     CLOCK: [2023-01-10 Tue 18:11]--[2023-01-10 Tue 18:19] =>  0:08
     - State "PROGRESS"   from "PROGRESS"   [2023-01-10 Tue 18:11] \\
       on review
     CLOCK: [2023-01-10 Tue 17:13]--[2023-01-10 Tue 18:05] =>  0:52
     CLOCK: [2023-01-10 Tue 15:04]--[2023-01-10 Tue 16:15] =>  1:11
     - State "PROGRESS"   from "STARTED"    [2023-01-10 Tue 13:22] \\
       GH actions stub created
     CLOCK: [2023-01-10 Tue 12:51]--[2023-01-10 Tue 13:22] =>  0:31
     CLOCK: [2023-01-10 Tue 10:35]--[2023-01-10 Tue 10:39] =>  0:04
     CLOCK: [2023-01-10 Tue 09:54]--[2023-01-10 Tue 10:30] =>  0:36
     - State "STARTED"    from "NEXT"       [2023-01-10 Tue 09:54]
     :END:
     <2023-01-04 Wed>

**** DONE Milestone 0.0.1: Schedule tasks
     CLOSED: [2023-01-08 Sun 13:50] DEADLINE: <2023-01-08 Sun> SCHEDULED: <2023-01-08 Sun>
     :PROPERTIES:
     :Effort:   01:00
     :END:
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2023-01-08 Sun 13:50]
     CLOCK: [2023-01-08 Sun 13:43]--[2023-01-08 Sun 13:50] =>  0:07
     CLOCK: [2023-01-08 Sun 13:08]--[2023-01-08 Sun 13:30] =>  0:22
     - State "STARTED"    from "NEXT"       [2023-01-08 Sun 13:08]
     :END:

**** DONE Write requirements for milestone 0.0.1     :milestone_001:planning:
     CLOSED: [2023-01-08 Sun 13:53] DEADLINE: <2023-01-08 Sun> SCHEDULED: <2023-01-08 Sun>
     :PROPERTIES:
     :Effort:   02:00
     :END:
     :LOGBOOK:
     - State "DONE"       from "PROGRESS"   [2023-01-08 Sun 13:53]
     - State "PROGRESS"   from "STARTED"    [2023-01-08 Sun 13:52] \\
       GH issues created.
       Milestone 0.0.1 page created.
     CLOCK: [2023-01-08 Sun 13:51]--[2023-01-08 Sun 13:53] =>  0:02
     - Rescheduled from "[2022-12-22 Thu]" on [2023-01-08 Sun 12:56] \\
       reschedule
     - State "STARTED"    from "NEXT"       [2023-01-08 Sun 06:25]
     :END:
     <<wrfm001>>

**** PROGRESS Create test matrix                                     :ACTIVE:
     :LOGBOOK:
     - State "PROGRESS"   from "STARTED"    [2023-01-12 Thu 10:41] \\
       for now we suppor linux, bash-{4.4-5.2}
     CLOCK: [2023-01-12 Thu 10:26]--[2023-01-12 Thu 10:41] =>  0:15
     CLOCK: [2023-01-11 Wed 21:28]--[2023-01-11 Wed 21:39] =>  0:11
     - State "STARTED"    from "NEXT"       [2023-01-11 Wed 21:28]
     :END:
     <2022-12-22 Thu>
**** DONE Create test runner                           :coding:milestone_001:
     CLOSED: [2023-01-10 Tue 15:04] DEADLINE: <2023-01-10 Tue> SCHEDULED: <2023-01-09 Mon>
     :PROPERTIES:
     :Effort:   02:00
     :END:
     :LOGBOOK:
     - State "DONE"       from "PROGRESS"   [2023-01-10 Tue 15:04]
     - State "PROGRESS"   from "STARTED"    [2023-01-10 Tue 15:03] \\
       simple wrapper around microspec
     CLOCK: [2023-01-10 Tue 14:09]--[2023-01-10 Tue 15:03] =>  0:54
     CLOCK: [2023-01-10 Tue 13:22]--[2023-01-10 Tue 13:58] =>  0:36
     - State "STARTED"    from "NEXT"       [2023-01-10 Tue 13:22]
     :END:
     <2023-01-08 Sun>

